# 3 Напишите программу, которая определит позицию второго вхождения строки в списке либо
# сообщит, что её нет.
# Пример:
# - список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# - список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# - список: [], ищем: "123", ответ: -1

l_1 = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
num = 0
for i in range(len(l_1)):
    if l_1[i]=="qwe":
        num+=1
        if num ==2:
            print(i)
if num ==1:
    print('-1')
elif "qwe" not in l_1:
    print('-2')